Revit 2027 API
ViewSystemsAnalysisReport.CancelSystemsAnalysis Method
 Cancels the systems analysis based on the report element id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void CancelSystemsAnalysis(
	Document document,
	ElementId reportElement
)
Public Shared Sub CancelSystemsAnalysis (
	document As Document,
	reportElement As ElementId
)
public:
static void CancelSystemsAnalysis(
	Document^ document,
	ElementId^ reportElement
)
static member CancelSystemsAnalysis :
        document : Document *
        reportElement : ElementId -> unit
Parameters
document Document
 The document where the report element existed.
reportElement ElementId
 The report element that identifies the analysis.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace